fixing build error with legacy-peer-deps=true, enhanced visuals using katex and chart.js
